-- 사원 릴레이션
create table 사원(
	사원번호 int primary key,
	이름 varchar(20) not null,
	입사일 date not null,
	호봉 int not null default 10,
	휴대폰 varchar(13) unique
);

drop table 사원;

insert into 사원 values(
	1101, '김정아', '2022-03-01', 20, '010-3452-0022'),
	(1102, '이가원', '2022-03-01', 18, '010-1478-1287'),
	(1103, '박영종', '2022-09-01', 15, '010-3412-1234'),
	(1201, '최강희', '2023-02-01', 21, '010-1122-3344'),
	(1202, '조현수', '2023-03-15', 14, '010-5566-4321'),
	(1203, '박제성', '2022-09-01', 17, '010-3452-3457'),
	(1312, '김민수', '2024-01-15', DEFAULT,'010-2340-0023'),
	(1314, '이정숙', '2024-02-10', DEFAULT,'010-3420-0991');

select * from 사원;

-- 부서 릴레이션
create table 부서(
	부서번호 int primary key,
	부서명 varchar(10) not null default '인사부',
	부서장 int unique,
	사무실 varchar(4) not null unique,
	전화번호 varchar(13) unique
);

insert into 부서 values
	(100, '기획실', 1101, 'A402', '02-233-1233'),
	(200, '비서실', 1102, 'A501', '02-455-1221'),
	(300, '총무부', 1200, 'B311', '041-567-3454'),
	(400, DEFAULT, 1203, 'B201', '041-344-6776'),
	(500, '자제부', NULL, 'A102', '02-458-45012');

table 부서;

-- 근무하다 릴레이션
create table 근무하다 (
	사번 int references 사원(사원번호),
	부서번호 int references 부서(부서번호),
	직책 varchar(10) not null
);

table 근무하다;

select * from 근무하다 where 직책 = '사원';

insert into 근무하다 values(
	1101, 100, '부장'),
	(1102, 200, '과장'),
	(1103, 200, '대리'),
	(1201, 300, '부장'),
	(1202, 300, '대리'),
	(1203, 400, '과장'),
	(1312, 100, '사원'),
	(1314, 100, '사원');